УТ_для_edt/src/InformationRegisters/ИсточникиПервичногоИнтереса/ИсточникиПервичногоИнтереса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсточникиПервичногоИнтереса</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КаналПервичногоИнтереса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникПервичногоИнтереса</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>CRM_Сайт</name>
    <type>
      <types>CatalogRef.CRM_Сайты</types>
    </type>
  </resources>
  <resources>
    <name>CRM_UTM_source</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>CRM_UTM_medium</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>CRM_UTM_pos</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>DocumentRef.УдалитьCRM_Сделка</types>
      <types>CatalogRef.СделкиСКлиентами</types>
      <types>DocumentRef.УдалитьCRM_Событие</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/CommonModules/CRM_Модуль_ОбщегоНазначенияСервер/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ИсточникиПервичногоИнтереса

Процедура CRM_УТ_ИсточникиПервичногоИнтересаПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ИсточникиПервичногоИнтереса") Тогда
		
		Если НЕ ЗначениеЗаполнено(Источник.Отбор.Период.Значение) Тогда
			ТекущаяДата = ТекущаяДата();
			Источник.Отбор.Период.Установить(ТекущаяДата);
			Для каждого Запись из Источник Цикл
				Запись.Период = ТекущаяДата;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьЗаписиИсточникаПервичногоИнтереса(Сделка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсточникиПервичногоИнтереса.Период КАК Период,
	|	ИсточникиПервичногоИнтереса.Партнер КАК Партнер
	|ИЗ
	|	РегистрСведений.ИсточникиПервичногоИнтереса КАК ИсточникиПервичногоИнтереса
	|ГДЕ
	|	ИсточникиПервичногоИнтереса.Сделка = &Сделка";
	Запрос.УстановитьПараметр("Сделка", Сделка);
	
	ТаблицаУдаляемыхЗаписей = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка Из ТаблицаУдаляемыхЗаписей Цикл
		МенеджерЗаписей = РегистрыСведений.ИсточникиПервичногоИнтереса.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.Период = Строка.Период;
		МенеджерЗаписей.Сделка = Сделка;
		МенеджерЗаписей.Партнер = Строка.Партнер;
		МенеджерЗаписей.Удалить();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ИсточникиПервичногоИнтереса


#Область МеханизмыОбновления

Процедура УстановитьМинимальноДопустимуюВерсию(МинимальноДопустимаяВерсия) Экспорт
	
	Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("ОбщиеМодули", "CRM_УТ_ОбновлениеИнформационнойБазы") Тогда
		МинимальноДопустимаяВерсия = "2.0.19"; // для УТиВсК3
	КонецЕсли;
	
КонецПроцедуры // УстановитьМинимальноДопустимуюВерсию

#КонецОбласти // МеханизмыОбновления

#Область УправлениеЭлектроннойПочтой

// Устанавливает папку электронного письма.
// Параметры:
//  Ссылка  - ссылка на письмо,
//  Папка - устанавливаемая папка электронного письма.
//
Процедура УстановитьПапкуЭлектронногоПисьма(Ссылка, Папка, РассчитыватьРассмотрено = Истина) Экспорт
	
	СтруктураДляЗаписи = РегистрыСведений.ПредметыПапкиВзаимодействий.РеквизитыВзаимодействия();
	СтруктураДляЗаписи.Папка                   = Папка;
	СтруктураДляЗаписи.РассчитыватьРассмотрено = РассчитыватьРассмотрено;
	РегистрыСведений.ПредметыПапкиВзаимодействий.ЗаписатьПредметыПапкиВзаимодействий(Ссылка, СтруктураДляЗаписи);
	
КонецПроцедуры

#КонецОбласти // УправлениеЭлектроннойПочтой

// Устанавливает режим ОбменДанными.Загрузка в Истина, когда выполняется запись набора 
// записей регистра сведений "ДокументыФизическихЛиц" при удалении Партнера-физлица или Контактного лица
// Делается для того, чтобы не отработали подписки на событие записи этого набора, так как в них 
// не поддрерживается работа с добавленными для CRM типами (владельцами документов физлиц).
//
// Параметры:
//  Объект  - набор записей регистра сведений "ДокументыФизическихЛиц"
//
Процедура ПроверкаПриУдаленииФизлица(Объект) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект.Отбор, "Физлицо") 
		 И НЕ ОбщегоНазначения.СсылкаСуществует(Объект.Отбор.Физлицо.Значение) Тогда
		Объект.ОбменДанными.Загрузка = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
